# 1.1 Введение в DevOps — Антон Белов

Вопрос 1. Что включает в себя понятие DevOps?
DevOps - методология, включающая в себя технологии, процессы и культуру, позволяющая объединить разработку, тестирование и эксплуатацию ПО в одной команде на стыке профессий.

Вопрос 2. Какая основная цель DevOps?
Ускорение внедрения нового ПО, а также обеспечения стабильности его работы. 

Вопрос 3. Расшифруйте аббревиатуры DevOps и DevSecOps.
Dev - разработка
Ops - эксплуатация
Sec - безопасность

Вопрос 4. Зачем проводится код-ревью?
Для выявления ошибок, неточностей кода, а также приведения его к принятому, с точке зрения культуры, в команде и обмену опытом его написания между ее членами.
